MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K50/mcu.h
// Register: VREFCON0
#define VREFCON0 VREFCON0
extern volatile unsigned char           VREFCON0            __at(0xF7D);
#ifndef _LIB_BUILD
asm("VREFCON0 equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned TSRNG                  :1;
        unsigned TSEN                   :1;
        unsigned FVRS                   :2;
        unsigned FVRST                  :1;
        unsigned FVREN                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned FVRS0                  :1;
        unsigned FVRS1                  :1;
    };
} VREFCON0bits_t;
extern volatile VREFCON0bits_t VREFCON0bits __at(0xF7D);
// bitfield macros
#define _VREFCON0_TSRNG_POSN                                0x2
#define _VREFCON0_TSRNG_POSITION                            0x2
#define _VREFCON0_TSRNG_SIZE                                0x1
#define _VREFCON0_TSRNG_LENGTH                              0x1
#define _VREFCON0_TSRNG_MASK                                0x4
#define _VREFCON0_TSEN_POSN                                 0x3
#define _VREFCON0_TSEN_POSITION                             0x3
#define _VREFCON0_TSEN_SIZE                                 0x1
#define _VREFCON0_TSEN_LENGTH                               0x1
#define _VREFCON0_TSEN_MASK                                 0x8
#define _VREFCON0_FVRS_POSN                                 0x4
#define _VREFCON0_FVRS_POSITION                             0x4
#define _VREFCON0_FVRS_SIZE                                 0x2
#define _VREFCON0_FVRS_LENGTH                               0x2
#define _VREFCON0_FVRS_MASK                                 0x30
#define _VREFCON0_FVRST_POSN                                0x6
#define _VREFCON0_FVRST_POSITION                            0x6
#define _VREFCON0_FVRST_SIZE                                0x1
#define _VREFCON0_FVRST_LENGTH                              0x1
#define _VREFCON0_FVRST_MASK                                0x40
#define _VREFCON0_FVREN_POSN                                0x7
#define _VREFCON0_FVREN_POSITION                            0x7
#define _VREFCON0_FVREN_SIZE                                0x1
#define _VREFCON0_FVREN_LENGTH                              0x1
#define _VREFCON0_FVREN_MASK                                0x80
#define _VREFCON0_FVRS0_POSN                                0x4
#define _VREFCON0_FVRS0_POSITION                            0x4
#define _VREFCON0_FVRS0_SIZE                                0x1
#define _VREFCON0_FVRS0_LENGTH                              0x1
#define _VREFCON0_FVRS0_MASK                                0x10
#define _VREFCON0_FVRS1_POSN                                0x5
#define _VREFCON0_FVRS1_POSITION                            0x5
#define _VREFCON0_FVRS1_SIZE                                0x1
#define _VREFCON0_FVRS1_LENGTH                              0x1
#define _VREFCON0_FVRS1_MASK                                0x20

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xF7E);
#ifndef _LIB_BUILD
asm("PMD0 equ 0F7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned                        :1;
        unsigned ACTMD                  :1;
        unsigned USBMD                  :1;
        unsigned UARTMD                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned STMD                   :1;
        unsigned                        :1;
        unsigned UART1MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0xF7E);
// bitfield macros
#define _PMD0_TMR1MD_POSN                                   0x0
#define _PMD0_TMR1MD_POSITION                               0x0
#define _PMD0_TMR1MD_SIZE                                   0x1
#define _PMD0_TMR1MD_LENGTH                                 0x1
#define _PMD0_TMR1MD_MASK                                   0x1
#define _PMD0_TMR2MD_POSN                                   0x1
#define _PMD0_TMR2MD_POSITION                               0x1
#define _PMD0_TMR2MD_SIZE                                   0x1
#define _PMD0_TMR2MD_LENGTH                                 0x1
#define _PMD0_TMR2MD_MASK                                   0x2
#define _PMD0_TMR3MD_POSN                                   0x2
#define _PMD0_TMR3MD_POSITION                               0x2
#define _PMD0_TMR3MD_SIZE                                   0x1
#define _PMD0_TMR3MD_LENGTH                                 0x1
#define _PMD0_TMR3MD_MASK                                   0x4
#define _PMD0_ACTMD_POSN                                    0x4
#define _PMD0_ACTMD_POSITION                                0x4
#define _PMD0_ACTMD_SIZE                                    0x1
#define _PMD0_ACTMD_LENGTH                                  0x1
#define _PMD0_ACTMD_MASK                                    0x10
#define _PMD0_USBMD_POSN                                    0x5
#define _PMD0_USBMD_POSITION                                0x5
#define _PMD0_USBMD_SIZE                                    0x1
#define _PMD0_USBMD_LENGTH                                  0x1
#define _PMD0_USBMD_MASK                                    0x20
#define _PMD0_UARTMD_POSN                                   0x6
#define _PMD0_UARTMD_POSITION                               0x6
#define _PMD0_UARTMD_SIZE                                   0x1
#define _PMD0_UARTMD_LENGTH                                 0x1
#define _PMD0_UARTMD_MASK                                   0x40
#define _PMD0_STMD_POSN                                     0x4
#define _PMD0_STMD_POSITION                                 0x4
#define _PMD0_STMD_SIZE                                     0x1
#define _PMD0_STMD_LENGTH                                   0x1
#define _PMD0_STMD_MASK                                     0x10
#define _PMD0_UART1MD_POSN                                  0x6
#define _PMD0_UART1MD_POSITION                              0x6
#define _PMD0_UART1MD_SIZE                                  0x1
#define _PMD0_UART1MD_LENGTH                                0x1
#define _PMD0_UART1MD_MASK                                  0x40
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xF7F);
#ifndef _LIB_BUILD
asm("PMD1 equ 0F7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned ADCMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CTMUMD                 :1;
        unsigned MSSPMD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned SSP1MD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned MSSP1MD                :1;
    };
    struct {
        unsigned EMBMD                  :1;
    };
} PMD1bits_t;
