MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K50/mcu.h
// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0xF86);
#ifndef _LIB_BUILD
asm("IOCB equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0xF86);
// bitfield macros
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80

// Register: IOCC
#define IOCC IOCC
extern volatile unsigned char           IOCC                __at(0xF87);
#ifndef _LIB_BUILD
asm("IOCC equ 0F87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCC0                  :1;
        unsigned IOCC1                  :1;
        unsigned IOCC2                  :1;
        unsigned                        :1;
        unsigned IOCC4                  :1;
        unsigned IOCC5                  :1;
        unsigned IOCC6                  :1;
        unsigned IOCC7                  :1;
    };
} IOCCbits_t;
extern volatile IOCCbits_t IOCCbits __at(0xF87);
// bitfield macros
#define _IOCC_IOCC0_POSN                                    0x0
#define _IOCC_IOCC0_POSITION                                0x0
#define _IOCC_IOCC0_SIZE                                    0x1
#define _IOCC_IOCC0_LENGTH                                  0x1
#define _IOCC_IOCC0_MASK                                    0x1
#define _IOCC_IOCC1_POSN                                    0x1
#define _IOCC_IOCC1_POSITION                                0x1
#define _IOCC_IOCC1_SIZE                                    0x1
#define _IOCC_IOCC1_LENGTH                                  0x1
#define _IOCC_IOCC1_MASK                                    0x2
#define _IOCC_IOCC2_POSN                                    0x2
#define _IOCC_IOCC2_POSITION                                0x2
#define _IOCC_IOCC2_SIZE                                    0x1
#define _IOCC_IOCC2_LENGTH                                  0x1
#define _IOCC_IOCC2_MASK                                    0x4
#define _IOCC_IOCC4_POSN                                    0x4
#define _IOCC_IOCC4_POSITION                                0x4
#define _IOCC_IOCC4_SIZE                                    0x1
#define _IOCC_IOCC4_LENGTH                                  0x1
#define _IOCC_IOCC4_MASK                                    0x10
#define _IOCC_IOCC5_POSN                                    0x5
#define _IOCC_IOCC5_POSITION                                0x5
#define _IOCC_IOCC5_SIZE                                    0x1
#define _IOCC_IOCC5_LENGTH                                  0x1
#define _IOCC_IOCC5_MASK                                    0x20
#define _IOCC_IOCC6_POSN                                    0x6
#define _IOCC_IOCC6_POSITION                                0x6
#define _IOCC_IOCC6_SIZE                                    0x1
#define _IOCC_IOCC6_LENGTH                                  0x1
#define _IOCC_IOCC6_MASK                                    0x40
#define _IOCC_IOCC7_POSN                                    0x7
#define _IOCC_IOCC7_POSITION                                0x7
#define _IOCC_IOCC7_SIZE                                    0x1
#define _IOCC_IOCC7_LENGTH                                  0x1
#define _IOCC_IOCC7_MASK                                    0x80

// Register: CTMUICON
#define CTMUICON CTMUICON
extern volatile unsigned char           CTMUICON            __at(0xF88);
#ifndef _LIB_BUILD
asm("CTMUICON equ 0F88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IRNG                   :2;
        unsigned ITRIM                  :6;
    };
    struct {
        unsigned IRNG0                  :1;
        unsigned IRNG1                  :1;
        unsigned ITRIM0                 :1;
        unsigned ITRIM1                 :1;
        unsigned ITRIM2                 :1;
        unsigned ITRIM3                 :1;
        unsigned ITRIM4                 :1;
        unsigned ITRIM5                 :1;
    };
} CTMUICONbits_t;
extern volatile CTMUICONbits_t CTMUICONbits __at(0xF88);
// bitfield macros
#define _CTMUICON_IRNG_POSN                                 0x0
#define _CTMUICON_IRNG_POSITION                             0x0
#define _CTMUICON_IRNG_SIZE                                 0x2
#define _CTMUICON_IRNG_LENGTH                               0x2
#define _CTMUICON_IRNG_MASK                                 0x3
#define _CTMUICON_ITRIM_POSN                                0x2
#define _CTMUICON_ITRIM_POSITION                            0x2
#define _CTMUICON_ITRIM_SIZE                                0x6
#define _CTMUICON_ITRIM_LENGTH                              0x6
#define _CTMUICON_ITRIM_MASK                                0xFC
#define _CTMUICON_IRNG0_POSN                                0x0
#define _CTMUICON_IRNG0_POSITION                            0x0
#define _CTMUICON_IRNG0_SIZE                                0x1
#define _CTMUICON_IRNG0_LENGTH                              0x1
#define _CTMUICON_IRNG0_MASK                                0x1
#define _CTMUICON_IRNG1_POSN                                0x1
#define _CTMUICON_IRNG1_POSITION                            0x1
#define _CTMUICON_IRNG1_SIZE                                0x1
#define _CTMUICON_IRNG1_LENGTH                              0x1
#define _CTMUICON_IRNG1_MASK                                0x2
#define _CTMUICON_ITRIM0_POSN                               0x2
#define _CTMUICON_ITRIM0_POSITION                           0x2
#define _CTMUICON_ITRIM0_SIZE                               0x1
#define _CTMUICON_ITRIM0_LENGTH                             0x1
#define _CTMUICON_ITRIM0_MASK                               0x4
#define _CTMUICON_ITRIM1_POSN                               0x3
#define _CTMUICON_ITRIM1_POSITION                           0x3
#define _CTMUICON_ITRIM1_SIZE                               0x1
#define _CTMUICON_ITRIM1_LENGTH                             0x1
#define _CTMUICON_ITRIM1_MASK                               0x8
#define _CTMUICON_ITRIM2_POSN                               0x4
#define _CTMUICON_ITRIM2_POSITION                           0x4
#define _CTMUICON_ITRIM2_SIZE                               0x1
#define _CTMUICON_ITRIM2_LENGTH                             0x1
#define _CTMUICON_ITRIM2_MASK                               0x10
#define _CTMUICON_ITRIM3_POSN                               0x5
#define _CTMUICON_ITRIM3_POSITION                           0x5
#define _CTMUICON_ITRIM3_SIZE                               0x1
#define _CTMUICON_ITRIM3_LENGTH                             0x1
#define _CTMUICON_ITRIM3_MASK                               0x20
#define _CTMUICON_ITRIM4_POSN                               0x6
#define _CTMUICON_ITRIM4_POSITION                           0x6
#define _CTMUICON_ITRIM4_SIZE                               0x1
#define _CTMUICON_ITRIM4_LENGTH                             0x1
#define _CTMUICON_ITRIM4_MASK                               0x40
#define _CTMUICON_ITRIM5_POSN                               0x7
#define _CTMUICON_ITRIM5_POSITION                           0x7
#define _CTMUICON_ITRIM5_SIZE                               0x1
#define _CTMUICON_ITRIM5_LENGTH                             0x1
#define _CTMUICON_ITRIM5_MASK                               0x80

